<script>
import common from './common'
export default {
  mixins: [common],
  data () {
    return {
      menus: [
        {
          title: '三星',
          groups: [
            {
              // title: '前三',
              items: [
                {id: '3-1-1-115', title: '直选复式', description: '从01-11共11个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的5个号码中的前3个号码相同，且顺序一致，即为中奖。', example: '如：选择01，02，03，开奖号码顺序为01，02，03 * *，即为中奖。'},
                {id: '3-1-2-115', title: '直选单式', description: '手动输入3个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的前3个号码相同，且顺序一致，即为中奖。', example: '如：手动输入01 02 03，开奖号码为是01 02 03 * *，即为中奖。'},
                {id: '3-1-3-115', title: '组选复式', description: '从01-11中共11个号码中选择3个号码，所选号码与当期顺序摇出的5个号码中的前3个号码相同，顺序不限，即为中奖。', example: '如：选择01 02 03（展开为01 02 03 * *，01 03 02 * *，02 01 03 * *，02 03 01 * *，03 01 02 * *，03 02 01 * *），开奖号码为03 01 02  如：，即为中奖。'},
                {id: '3-1-4-115', title: '组选单式', description: '手动输入3个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的前3个号码相同，顺序不限，即为中奖。', example: '如：手动输入01 02 03（展开为01 02 03 * *，01 03 02 * * , 02 01 03 * *，02 03 01 * *，03 01 02 * *，03 02 01 * *），开奖号码为01 03 02 * *，即为中奖。'},
                {id: '3-1-5-115', title: '组选胆拖', description: '分别从胆码和拖码的01-11中，至少选择1个胆码和2个拖码组成一注。当期顺序摇出的5个号码中的前3个号码中同时包含所选的1个胆码和2个拖码，顺序不限，即为中奖。', example: '如：选择胆码 01，选择拖码 02 06，开奖号码为 02 01 06 * *，即为中奖。'}
              ]
            }
          ]
        },
        {
          title: '二星',
          groups: [
            {
              // title: '前二',
              items: [
                {id: '2-1-1-115', title: '直选复式', description: '从01-11共11个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的5个号码中的前2个号码相同，且顺序一致，即中奖。', example: '如：选择01 02，开奖号码 01 02 * * *，即为中奖。'},
                {id: '2-1-2-115', title: '直选单式', description: '手动输入2个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的前2个号码相同，且顺序一致，即为中奖。', example: '如：手动输入 01 02，开奖号码为01 02 * * *，即为中奖。'},
                {id: '2-1-3-115', title: '组选复式', description: '从01-11中共11个号码中选择2个号码，所选号码与当期顺序摇出的5个号码中的前2个号码相同，顺序不限，即为中奖。 ', example: '如：选择01 02（展开为01 02 * * *，02 01 * * *），开奖号码为02 01 * * * 或 01 02 * * *，即为中奖。'},
                {id: '2-1-4-115', title: '组选单式', description: '手动输入2个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的前2个号码相同，顺序不限，即为中奖。', example: '如：手动输入01 02（展开为01 02 * * *，02 01 * * *），开奖号码为02 01 *** 或 01 02 ***，即为中奖。'},
                {id: '2-1-5-115', title: '组选胆拖', description: '分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注。当期顺序摇出的5个号码中的前2个号码中同时包含所选的1个胆码和1个拖码，顺序不限，即为中奖。', example: '如：选择胆码 01，选择拖码 06，开奖号码为 06 01* * *，即为中奖。'}
              ]
            }
          ]
        },
        {
          title: '一星',
          groups: [
            {
              // title: '前二直选',
              items: [
                {id: '1-1-1-115', title: '定位胆', description: '从第一位，第二位，第三位任意1个位置或多个位置上选择1个号码，所选号码与相同位置上的开奖号码一致，即为中奖', example: '  如：万位上选择01，开奖号码为01 * * * *，即为中奖。'}
              ]
            }
          ]
        },
        {
          title: '不定位',
          groups: [
            {
              // title: '不定位',
              items: [
                {id: '0-1-1-115', title: '前三不定位', description: '从01-11中共11个号码中选择1个号码，每注由1个号码组成，只要当期顺序摇出的第一位、第二位、第三位开奖号码中包含所选号码，即为中奖。', example: '如：选择01，开奖号码为01 * * * *，* 01 * * *，* * 01 * *,即为中奖。'}
              ]
            }
          ]
        },
        {
          title: '任选',
          groups: [
            {
              title: '复式',
              items: [
                {id: '-1-1-1-115', title: '一中一', description: '从01-11共11个号码中选择1个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05，开奖号码为08 04 11 05 03，即为中奖'},
                {id: '-1-1-2-115', title: '二中二', description: '从01-11共11个号码中选择2个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-1-3-115', title: '三中三', description: '从01-11共11个号码中选择3个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04 11，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-1-4-115', title: '四中四', description: '从01-11共11个号码中选择4个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04 08 03，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-1-5-115', title: '五中五', description: '从01-11共11个号码中选择5个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04 11 03 08，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-1-6-115', title: '六中五', description: '从01-11共11个号码中选择6个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖', example: '如：选择05 10 04 11 03 08，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-1-7-115', title: '七中五', description: '从01-11共11个号码中选择7个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04 10 11 03 08 09，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-1-8-115', title: '八中五', description: '从01-11共11个号码中选择8个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04 11 03 08 10 09 01，开奖号码为08 04 11 05 03，即为中奖。'}
              ]
            },
            {
              title: '单式',
              items: [
                {id: '-1-2-1-115', title: '一中一', description: '从01-11共11个号码中选择1个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05，开奖号码为08 04 11 05 03，即为中奖'},
                {id: '-1-2-2-115', title: '二中二', description: '从01-11共11个号码中选择2个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-2-3-115', title: '三中三', description: '从01-11共11个号码中选择3个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04 11，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-2-4-115', title: '四中四', description: '从01-11共11个号码中选择4个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04 08 03，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-2-5-115', title: '五中五', description: '从01-11共11个号码中选择5个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04 11 03 08，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-2-6-115', title: '六中五', description: '从01-11共11个号码中选择6个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖', example: '如：选择05 10 04 11 03 08，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-2-7-115', title: '七中五', description: '从01-11共11个号码中选择7个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04 10 11 03 08 09，开奖号码为08 04 11 05 03，即为中奖。'},
                {id: '-1-2-8-115', title: '八中五', description: '从01-11共11个号码中选择8个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。', example: '如：选择05 04 11 03 08 10 09 01，开奖号码为08 04 11 05 03，即为中奖。'}
              ]
            },
            {
              title: '胆拖',
              items: [
                {id: '-1-3-1-115', title: '二中二', description: '分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和1个拖码，所选胆码必须全中，即为中奖。', example: '如：选择胆码 08，选择拖码 06，开奖号码为 06 08 11 09 02，即为中奖'},
                {id: '-1-3-2-115', title: '三中三', description: '分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和2个拖码，所选胆码必须全中，即为中奖。', example: '如：选择胆码 08，选择拖码 06 11，开奖号码为 06 08 11 09 02，即为中奖。'},
                {id: '-1-3-3-115', title: '四中四', description: '分别从胆码和拖码的01-11中，至少选择1个胆码和3个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和3个拖码，所选胆码必须全中，即为中奖。', example: '如：选择胆码 08，选择拖码 06 09 11，开奖号码为 06 08 11 09 02，即为中奖。'},
                {id: '-1-3-4-115', title: '五中五', description: '分别从胆码和拖码的01-11中，至少选择1个胆码和4个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和4个拖码，所选胆码必须全中，即为中奖。', example: '如：选择胆码 08，选择拖码 02 06 09 11，开奖号码为  06 08 11 09 02，即为中奖。'},
                {id: '-1-3-5-115', title: '六中五', description: '分别从胆码和拖码的01-11中，至少选择1个胆码和5个拖码组成一注，只要当期顺序摇出的5个开奖号码同时存在于胆码和拖码的任意组合中，即为中奖。', example: '如：选择胆码 08，选择拖码 01 02 05 06 09 11，开奖号码为 06 08 11 09 02，即为中奖。'},
                {id: '-1-3-6-115', title: '七中五', description: '分别从胆码和拖码的01-11中，至少选择1个胆码和6个拖码组成一注，只要当期顺序摇出的5个开奖号码同时存在于胆码和拖码的任意组合中，即为中奖。', example: '如：选择胆码 08，选择拖码 01 02 05 06 07 09 11，开奖号码为 06 08 11 09 02，即为中奖。'},
                {id: '-1-3-7-115', title: '八中五', description: '分别从胆码和拖码的01-11中，至少选择1个胆码和7个拖码组成一注，只要当期顺序摇出的5个开奖号码同时存在于胆码和拖码的任意组合中，即为中奖。', example: '如：选择胆码 08，选择拖码 01 02 03 05 06 07 09 11，开奖号码为 06 08 11 09 02，即为中奖。'}
              ]
            }
          ]
        },
        {
          title: '趣味',
          groups: [
            {
              // title: '五位',
              items: [
                {id: '-2-1-1-115', title: '定单双', description: '从5种单双个数组合中选择1种组合，当期开奖号码的单双个数与所选单双组合一致，即为中奖。', example: '如：选择5单0双，开奖号码01，03，05，07，09五个单数，即为中奖。'},
                {id: '-2-1-2-115', title: '猜中位', description: '从3-9中选择1个号码进行购买，所选号码与5个开奖号码按照大小顺序排列后的第3个号码相同，即为中奖。', example: '如：选择8，开奖号码为11，04，09，05，08，按开奖号码的数字大小排列为04，05，08，09，11，中间数08，即为中奖。'}
              ]
            }
          ]
        },
        {
          title: '龙虎',
          groups: [
            {
              // title: '五位',
              items: [
                // {id: '-3-1-3-115', title: '混选', description: '根据选择的位置比较第一位号码与第二位号码的大小， 大则为：龙， 小则为：虎', example: '龙[第一位，第二位]，开奖号码08 07 * * *，即中龙虎'},
                {id: '-3-1-4-115', title: '一二位', description: '比较第一位与第二位号码的大小，大则为：龙，小则为：虎，相等则为：和，其中和为一等奖，龙虎为二等奖', ps: 'w,q', ludan: '1v2', ludantitle: '一VS二'},
                {id: '-3-1-5-115', title: '一三位', description: '比较第一位与第三位号码的大小，大则为：龙，小则为：虎，相等则为：和，其中和为一等奖，龙虎为二等奖', ps: 'w,b', ludan: '1v3', ludantitle: '一VS三'},
                {id: '-3-1-6-115', title: '一四位', description: '比较第一位与第四位号码的大小，大则为：龙，小则为：虎，相等则为：和，其中和为一等奖，龙虎为二等奖', ps: 'w,s', ludan: '1v4', ludantitle: '一VS四'},
                {id: '-3-1-7-115', title: '一五位', description: '比较第一位与第五位号码的大小，大则为：龙，小则为：虎，相等则为：和，其中和为一等奖，龙虎为二等奖', ps: 'w,g', ludan: '1v5', ludantitle: '一VS五'},
                {id: '-3-1-8-115', title: '二三位', description: '比较第二位与第三位号码的大小，大则为：龙，小则为：虎，相等则为：和，其中和为一等奖，龙虎为二等奖', ps: 'q,b', ludan: '2v3', ludantitle: '二VS三'},
                {id: '-3-1-9-115', title: '二四位', description: '比较第二位与第四位号码的大小，大则为：龙，小则为：虎，相等则为：和，其中和为一等奖，龙虎为二等奖', ps: 'q,s', ludan: '2v4', ludantitle: '二VS四'},
                {id: '-3-1-10-115', title: '二五位', description: '比较第二位与第五位号码的大小，大则为：龙，小则为：虎，相等则为：和，其中和为一等奖，龙虎为二等奖', ps: 'q,g', ludan: '2v5', ludantitle: '二VS五'},
                {id: '-3-1-11-115', title: '三四位', description: '比较第三位与第四位号码的大小，大则为：龙，小则为：虎，相等则为：和，其中和为一等奖，龙虎为二等奖', ps: 'b,s', ludan: '3v4', ludantitle: '三VS四'},
                {id: '-3-1-12-115', title: '三五位', description: '比较第三位与第五位号码的大小，大则为：龙，小则为：虎，相等则为：和，其中和为一等奖，龙虎为二等奖', ps: 'b,g', ludan: '3v5', ludantitle: '三VS五'},
                {id: '-3-1-13-115', title: '四五位', description: '比较第四位与第五位号码的大小，大则为：龙，小则为：虎，相等则为：和，其中和为一等奖，龙虎为二等奖', ps: 's,g', ludan: '4v5', ludantitle: '四VS五'}
              ]
            }
          ]
        }
      ],
      getTitle () {
        switch (this.type.id.slice(0, 2)) {
          case '3-':
            return '三星'
          case '2-':
            return '二星'
          case '1-':
            return '一星'
          case '0-':
            return '不定位'
          case '-1':
            return '任选'
          case '-2':
            return '趣味'
          case '-3':
            return '龙虎'
        }
      },
      gameType: 'G115',
      // 玩法信息
      type: {id: '3-1-3-115', title: '组选复式', description: '从01-11中共11个号码中选择3个号码，所选号码与当期顺序摇出的5个号码中的前3个号码相同，顺序不限，即为中奖。', example: '如：选择01 02 03（展开为01 02 03 * *，01 03 02 * *，02 01 03 * *，02 03 01 * *，03 01 02 * *，03 02 01 * *），开奖号码为03 01 02  如：，即为中奖。'}
    }
  },
  methods: {
    getUpTitle () {
      switch (this.type.id.slice(0, 2)) {
        case '3-':
          return '三星'
        case '2-':
          return '二星'
        case '1-':
          return '一星'
        case '0-':
          return '不定位'
        case '-1':
          return '任选'
        case '-2':
          return '趣味'
        case '-3':
          return '龙虎'
      }
    }
  }
}
</script>
