<script>
import common from './common'
export default {
  mixins: [common],
  data () {
    return {
      gameType: 'PK10',
      menus: [
        {
          title: '猜冠亚军',
          groups: [
            {
              items: [
                {id: '-1-1-1-PK10', title: '猜冠军', description: '从01-10中共10个号码中选择1个号码，每注由1个号码组成，只要当期冠军号码为所选号码，即为中奖。', example: '投注方案：01； 开奖号码：01 * * * * * * * * * *，即中猜冠军。'},
                {id: '-1-1-2-PK10', title: '猜冠亚军', description: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02； 开奖号码：01 02 * * * * * * * * *，即中猜冠亚军。'},
                {id: '-1-1-8-PK10', title: '猜冠亚军单式', description: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖。', example: '投注方案：0102； 开奖号码：01 02 * * * * * * * * *，即中猜冠亚军单式。'}
              ]
            }
          ]
        },
        {
          title: '猜三四名',
          groups: [
            {
              items: [
                {id: '-1-1-3-PK10', title: '猜前三名', description: '从01-10共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02,03； 开奖号码：01 02 03 * * * * * * * *，即中猜前三名。'},
                {id: '-1-2-2-PK10', title: '猜前三名单式', description: '从01-10共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02,03； 开奖号码：01 02 03 * * * * * * * *，即中猜前三名单式。'},
                {id: '-1-1-4-PK10', title: '猜前四名', description: '从01-10共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02,03,04； 开奖号码：01 02 03 04 * * * * * * *，即中猜前四名。'},
                {id: '-1-2-3-PK10', title: '猜前四名单式', description: '从01-10共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02,03,04； 开奖号码：01 02 03 04 * * * * * * *，即中猜前四名单式。'},
                {id: '-1-2-1-PK10', title: '猜三四名复式', description: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的第3个,第4个号码相同，且顺序一致，即为中奖。', example: '投注方案：0102； 开奖号码：* * 01 02 * * * * * * *，即中猜冠亚军单式。'},
                {id: '-1-1-9-PK10', title: '猜三四名单式', description: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的第3个,第4个号码相同，且顺序一致，即为中奖。', example: '投注方案：0102； 开奖号码：* * 01 02 * * * * * * *，即中猜冠亚军单式。'}

              ]
            }
          ]
        },
        {
          title: '龙虎',
          groups: [
            {
              items: [
                {id: '-1-3-1-PK10', title: '一VS十', description: '第一名和第十名比较，第一名大是龙，第十名大是虎', example: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。', ps: '0,9', ludan: '1v10', ludantitle: '一VS十'},
                {id: '-1-3-2-PK10', title: '二VS九', description: '第二名和第九名比较，第二名大是龙，第九名大是虎', example: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。', ps: '1,8', ludan: '2v9', ludantitle: '二VS九'},
                {id: '-1-3-3-PK10', title: '三VS八', description: '第三名和第八名比较，第三名大是龙，第八名大是虎', example: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。', ps: '2,7', ludan: '3v8', ludantitle: '三VS八'},
                {id: '-1-3-4-PK10', title: '四VS七', description: '第四名和第七名比较，第四名大是龙，第七名大是虎', example: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。', ps: '3,6', ludan: '4v7', ludantitle: '四VS七'},
                {id: '-1-3-5-PK10', title: '五VS六', description: '第五名和第六名比较，第五名大是龙，第六名大是虎', example: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。', ps: '4,5', ludan: '5v6', ludantitle: '五VS六'}
              ]
            }
          ]
        },
        {
          title: '定位胆',
          groups: [
            {
              items: [
                {id: '-1-1-7-PK10', title: '定位胆', description: '从第一名到第十名、01-10共10个号码中，选择其中一名次中的任意1个号码当作一注，所选名次的号码与当期顺序摇出的10个号码中对应名次的号码一致，即为中奖', example: '投注方案：第一名01，开奖号码： 01 * * * * * * * * *，即中定位胆'}
              ]
            }
          ]
        },
        // ==============================================================================================================================================================
        {
          title: '二星',
          groups: [
            {
              title: '前二',
              items: [
                {id: '-1-4-1-PK10', title: '直选复式', description: '从01-10中共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖 ', e: '投注方案：05 08；开奖号码前二位：05 08，即中前二直选复式。', example: ''},
                {id: '-1-4-2-PK10', title: '直选单式', description: '手动输入2个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖 ', e: '投注方案：05 08； 开奖号码：05 08，即中前二直选单式。', example: ''},
                {id: '-1-4-3-PK10', title: '组选复式', description: '从01-10中共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，即为中奖 ', e: '投注方案：05 08； 开奖号码：05 08或者08 05，即中前二组选复式。', example: ''},
                {id: '-1-4-4-PK10', title: '组选单式', description: '手动输入2个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的前2个号码相同，即为中奖 ', e: '投注方案：05 08； 开奖号码：5 08或者08 05，即中前二组选单式。', example: ''}
              ]
            },
            {
              title: '后二',
              items: [
                {id: '-1-4-5-PK10', title: '直选复式', description: '从01-10中共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的后2个号码相同，且顺序一致，即为中奖 ', e: '投注方案： 05 08；开奖号码后二位： 05 08，即中后二直选复式。', example: ''},
                {id: '-1-4-6-PK10', title: '直选单式', description: '手动输入2个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的后2个号码相同，且顺序一致，即为中奖 ', e: '投注方案： 05 08； 08；开奖号码后二位： 05 08，即中后二直选单式。', example: ''},
                {id: '-1-4-7-PK10', title: '组选复式', description: '从01-10中共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的后2个号码相同，即为中奖', e: '投注方案： 05 08； 08；开奖号码后二位： 05 08 或者 08 05，即中后二组选复式。', example: ''},
                {id: '-1-4-8-PK10', title: '组选单式', description: '手动输入2个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的后2个号码相同，且顺序一致，即为中奖', e: '投注方案： 05 08； 08；开奖号码后二位： 05 08 或者 08 05，即中后二组选单式。', example: ''}
              ]
            },
            {
              title: '三四名',
              items: [
                {id: '-1-4-9-PK10', title: '直选复式', description: '从01-10中共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的第3个，第4个号码相同，且顺序一致，即为中奖 ', e: '投注方案： 05 08；开奖号码三四名位： 05 08，即中三四名直选复式。', example: ''},
                {id: '-1-4-10-PK10', title: '直选单式', description: '手动输入2个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的第3个，第4个号码相同，且顺序一致，即为中奖', e: '投注方案： 05 08； 08；开奖号码三四名位： 05 08 ，即中三四名直选单式。', example: ''},
                {id: '-1-4-11-PK10', title: '组选复式', description: '从01-10中共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的第3个，第4个号码相同，即为中奖 ', e: '投注方案： 05 08； 08；开奖号码后二位： 05 08 或者 08 05，即中后二组选复式。', example: ''},
                {id: '-1-4-12-PK10', title: '组选单式', description: '手动输入2个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的第3个，第4个号码相同，即为中奖 ', e: '投注方案： 05 08； 08；开奖号码三四名位： 05 08 或者 08 05，即中三四名组选单式。', example: ''}
              ]
            }
          ]
        },
        {
          title: '三星',
          groups: [
            {
              title: '前三',
              items: [
                {id: '-1-5-1-PK10', title: '直选复式', description: '从01-10中共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖 ', e: '投注方案：05 06 08；开奖号码前三位： 05 06 08，即中前三直选复式。', example: ''},
                {id: '-1-5-2-PK10', title: '直选单式', description: '手动输入3个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖 ', e: '投注方案：05 06 08； 08；开奖号码前三位： 05 06 08，即中前三直选单式。', example: ''},
                {id: '-1-5-3-PK10', title: '组选复式', description: '从01-10中共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，即为中奖 ', e: '投注方案：05 06 08； 08；开奖号码前三位： 05 06 08 或者 08 06 05，即中前三组选复式。', example: ''},
                {id: '-1-5-4-PK10', title: '组选单式', description: '手动输入3个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的前3个号码相同，即为中奖 ', e: '投注方案：05 06 08； 08；开奖号码前三位： 05 06 08 或者 08 06 05，即中前三组选单式。', example: ''}
              ]
            },
            {
              title: '后三',
              items: [
                {id: '-1-5-5-PK10', title: '直选复式', description: '从01-10中共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的后3个号码相同，且顺序一致，即为中奖 ', e: '投注方案： 05 06 08；开奖号码后三位： 05 06 08，即中后三直选复式。', example: ''},
                {id: '-1-5-6-PK10', title: '直选单式', description: '手动输入3个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的后3个号码相同，且顺序一致，即为中奖 ', e: '投注方案： 05 06 08； 08；开奖号码后三位： 05 06 08，即中后三直选单式。', example: ''},
                {id: '-1-5-7-PK10', title: '组选复式', description: '从01-10中共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的后3个号码相同，即为中奖 ', e: '投注方案： 05 06 08； 08；开奖号码后三位： 05 06 08 或者 08 06 05，即中后三组选复式。', example: ''},
                {id: '-1-5-8-PK10', title: '组选单式', description: '手动输入3个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的后3个号码相同，即为中奖 ', e: '投注方案： 05 06 08； 08；开奖号码后三位： 05 06 08 或者 08 06 05，即中后三组选单式。', example: ''}
              ]
            }
          ]
        },
        {
          title: '四星',
          groups: [
            {
              title: '前四',
              items: [
                {id: '-1-6-1-PK10', title: '直选复式', description: '从01-10中共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖 ', e: '投注方案：03 05 06 08； 开奖号码前四位： 03 05 06 08，即中前四直选复式。', example: ''},
                {id: '-1-6-2-PK10', title: '直选单式', description: '手动输入4个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖', e: '投注方案：03 05 06 08； 开奖号码前四位： 03 05 06 08，即中前四直选单式。', example: ''},
                {id: '-1-6-3-PK10', title: '组选复式', description: '从01-10中共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，即为中奖 ', e: '投注方案：03 05 06 08； 开奖号码前四位： 03 05 06 08 或者 08 06 05 03，即中前四组选复式。', example: ''},
                {id: '-1-6-4-PK10', title: '组选单式', description: '手动输入4个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的前4个号码相同，即为中奖', e: '投注方案：03 05 06 08； 开奖号码前四位： 03 05 06 08 或者 08 06 05 03，即中前四组选单式。', example: ''}
              ]
            },
            {
              title: '后四',
              items: [
                {id: '-1-6-5-PK10', title: '直选复式', description: '从01-10中共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的后4个号码相同，且顺序一致，即为中奖', e: '投注方案： 03 05 06 08；开奖号码后四位： 03 05 06 08，即中后四直选复式。', example: ''},
                {id: '-1-6-6-PK10', title: '直选单式', description: '手动输入4个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的后4个号码相同，且顺序一致，即为中奖 ', e: '投注方案： 03 05 06 08； 开奖号码后四位： 03 05 06 08，即中后四直选单式。', example: ''},
                {id: '-1-6-7-PK10', title: '组选复式', description: '从01-10中共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的后4个号码相同，即为中奖 ', e: '投注方案： 03 05 06 08； 开奖号码后四位： 03 05 06 08 或者 08 06 05 03，即中后四组选复式。', example: ''},
                {id: '-1-6-8-PK10', title: '组选单式', description: '手动输入4个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的后4个号码相同，且顺序一致，即为中奖 ', e: '投注方案： 03 05 06 08； 开奖号码后四位： 03 05 06 08 或者 08 06 05 03，即中后四组选单式。', example: ''}
              ]
            }
          ]
        },
        {
          title: '五星',
          groups: [
            {
              title: '前五',
              items: [
                {id: '-1-7-1-PK10', title: '直选复式', description: '从01-10中共10个号码中选择5个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前5个号码相同，且顺序一致，即为中奖', e: '投注方案：03 05 06 08 09；开奖号码前五位： 03 05 06 08 09，即中前五直选复式。', example: ''},
                {id: '-1-7-2-PK10', title: '直选单式', description: '手动输入5个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的前5个号码相同，且顺序一致，即为中奖 ', e: '投注方案：03 05 06 08 09； 09；开奖号码前五位： 03 05 06 08 09，即中前五直选单式。', example: ''},
                {id: '-1-7-3-PK10', title: '组选复式', description: '从01-10中共10个号码中选择5个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前5个号码相同，即为中奖 ', e: '投注方案： 03 05 06 08 09； 09；开奖号码前五位： 05 06 08 09 或者 09 08 06 05 03，即中前五组选复式。', example: ''},
                {id: '-1-7-4-PK10', title: '组选单式', description: '手动输入5个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的前5个号码相同，即为中奖 ', e: '投注方案：03 05 06 08 09； 09；开奖号码前五位： 03 05 06 08 09 或者 09 08 06 05 03，即中前五组选单式。', example: ''}
              ]
            },
            {
              title: '后五',
              items: [
                {id: '-1-7-5-PK10', title: '直选复式', description: '从01-10中共10个号码中选择5个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的后5个号码相同，且顺序一致，即为中奖', e: '投注方案：03 05 06 08 09；开奖号码后五位： 03 05 06 08 09，即中后五直选复式。', example: ''},
                {id: '-1-7-6-PK10', title: '直选单式', description: '手动输入5个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的后5个号码相同，且顺序一致，即为中奖 ', e: '投注方案：03 05 06 08 09； 09；开奖号码后五位： 03 05 06 08 09，即中后五直选单式。', example: ''},
                {id: '-1-7-7-PK10', title: '组选复式', description: '从01-10中共10个号码中选择5个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的后5个号码相同，即为中奖', e: '投注方案： 03 05 06 08 09； 09；开奖号码后五位： 05 06 08 09 或者 09 08 06 05 03，即中后五组选复式。', example: ''},
                {id: '-1-7-8-PK10', title: '组选单式', description: '手动输入5个不重复的号码组成一注，输入号码与当期顺序摇出的10个号码中的后5个号码相同，即为中奖', e: '投注方案：03 05 06 08 09； 09；开奖号码后五位： 03 05 06 08 09 或者 09 08 06 05 03，即中后五组选单式。', example: ''}
              ]
            }
          ]
        },
        {
          title: '不定位',
          groups: [
            {
              items: [
                {id: '-1-8-1-PK10', title: '前三不定位', description: '从01-10中共10个号码中选择1个号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码中任意1个号码相同，即为中奖', e: '投注方案：03 05 06；开奖号码前三位： 03 05 06，即中前三不定位。', example: ''},
                {id: '-1-8-2-PK10', title: '后三不定位', description: '从01-10中共10个号码中选择1个号码组成一注，所选号码与当期顺序摇出的10个号码中的后3个号码中任意1个号码相同，即为中奖', e: '投注方案：03 05 06；开奖号码后三位： 03 05 06，即中后三不定位。', example: ''},
                {id: '-1-8-3-PK10', title: '前四不定位', description: '从01-10中共10个号码中选择1个号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码中任意1个号码相同，即为中奖', e: '投注方案：03 05 06 08；开奖号码前四位： 03 05 06 08，即中前四不定位。', example: ''},
                {id: '-1-8-4-PK10', title: '后四不定位', description: '从01-10中共10个号码中选择1个号码组成一注，所选号码与当期顺序摇出的10个号码中的后4个号码中任意1个号码相同，即为中奖', e: '投注方案：03 05 06 08；开奖号码后四位： 03 05 06 08，即中后四不定位。', example: ''},
                {id: '-1-8-5-PK10', title: '前五不定位', description: '从01-10中共10个号码中选择1个号码组成一注，所选号码与当期顺序摇出的10个号码中的前5个号码中任意1个号码相同，即为中奖', e: '投注方案：03 05 06 08 09；开奖号码前五位： 03 05 06 08 09，即中前五不定位。', example: ''},
                {id: '-1-8-6-PK10', title: '后五不定位', description: '从01-10中共10个号码中选择1个号码组成一注，所选号码与当期顺序摇出的10个号码中的后5个号码中任意1个号码相同，即为中奖', e: '投注方案：03 05 06 08 09；开奖号码后五位： 03 05 06 08 09，即中后五不定位。', example: ''}
              ]
            }
          ]
        },
        {
          title: '冠亚和值',
          groups: [
            {

              items: [
                {id: '-1-9-1-PK10', title: '和值', description: '冠军车号＋亚军车号＝冠亚和值（为3~19)下方数字表明注数', e: '投注方案： 3；开奖号码前两位：01 02或者02 01,即中冠亚和值。', example: ''},
                {id: '-1-9-2-PK10', title: '和值大小单双', description: '冠亚和单双：“冠亚和值”为单视为投注“单”的注单视为中奖，为双视为投注“双”的注单视为中奖，其余视为不中奖。冠亚和大小：“冠亚和值”大于11时投注“大”的注单视为中奖，小于或等于11时投注“小”的注单视为中奖，其余视为不中奖。', e: '投注方案： 小；开奖号码前两位：01 02,即中冠亚和值。', example: ''}
              ]
            }
          ]
        },
       {
          title: '大小单双',
          groups: [
            {
              items: [
                {id: '-1-10-1-PK10', title: '大小单双', description: '选择位置，从‘大小单双’中选1个或以上号码。‘6 7 8 9 10’视为大，‘1 2 3 4 5’视为小；‘1 3 5 7 9’视为单，‘2 4 6 8 1 0’视为双，所选号码中包含‘对应位置开奖’即为中奖', e: '投注方案： 冠军-小；开奖号码前一位：01,即中冠亚和值大小单双。', example: ''}
              ]
            }
          ]
        }
      ],
      // 玩法信息
      type: {
        id: '-1-1-1-PK10',
        // 玩法名
        title: '猜冠军',
        // 玩法描述
        description: '从01-10中共10个号码中选择1个号码，每注由1个号码组成，只要当期冠军号码为所选号码，即为中奖。'
      },
      lucknumbers: ['01', '01', '01', '01', '01', '01', '01', '01', '01', '01'],
      getTitle () {
        switch (this.type.id.slice(0, 6)) {
          case '-1-1-1':
            return '猜冠亚军'
          case '-1-1-2':
            return '猜冠亚军'
          case '-1-1-3':
            return '猜三四名'
          case '-1-1-4':
            return '猜三四名'
          case '-1-1-5':
            return '猜三四名'
          case '-1-1-8':
            return '猜冠亚军'
          case '-1-3-1':
          case '-1-3-2':
          case '-1-3-3':
          case '-1-3-4':
          case '-1-3-5':
            return '龙虎'
          case '-1-1-7':
            return '定位胆'
          case '-1-1-9':
            return '猜三四名'
          case '-1-2-1':
            return '猜三四名'
          case '-1-2-2':
            return '猜三四名'
          case '-1-2-3':
            return '猜三四名'
          case '-1-2-4':
            return '猜三四名'
        }

        switch (this.type.id) {
          case '-1-4-1-PK10':
          case '-1-4-2-PK10':
          case '-1-4-3-PK10':
          case '-1-4-4-PK10':
          case '-1-4-5-PK10':
          case '-1-4-6-PK10':
          case '-1-4-7-PK10':
          case '-1-4-8-PK10':
          case '-1-4-9-PK10':
          case '-1-4-10-PK10':
          case '-1-4-11-PK10':
          case '-1-4-12-PK10':
            return '二星'
          case '-1-5-1-PK10':
          case '-1-5-2-PK10':
          case '-1-5-3-PK10':
          case '-1-5-4-PK10':
          case '-1-5-5-PK10':
          case '-1-5-6-PK10':
          case '-1-5-7-PK10':
          case '-1-5-8-PK10':
            return '三星'
          case '-1-6-1-PK10':
          case '-1-6-2-PK10':
          case '-1-6-3-PK10':
          case '-1-6-4-PK10':
          case '-1-6-5-PK10':
          case '-1-6-6-PK10':
          case '-1-6-7-PK10':
          case '-1-6-8-PK10':
            return '四星'
          case '-1-7-1-PK10':
          case '-1-7-2-PK10':
          case '-1-7-3-PK10':
          case '-1-7-4-PK10':
          case '-1-7-5-PK10':
          case '-1-7-6-PK10':
          case '-1-7-7-PK10':
          case '-1-7-8-PK10':
            return '五星'
          case '-1-8-1-PK10':
          case '-1-8-2-PK10':
          case '-1-8-3-PK10':
          case '-1-8-4-PK10':
          case '-1-8-5-PK10':
          case '-1-8-6-PK10':
            return '不定位'
          case '-1-9-1-PK10':
          case '-1-9-2-PK10':
            return '冠亚和值'
          case '-1-10-1-PK10':
            return '大小单双'
        }
      }
    }
  },
  methods: {
    getUpTitle () {
      switch (this.type.id.slice(0, 6)) {
        case '-1-1-1':
          return '猜冠亚军'
        case '-1-1-2':
          return '猜冠亚军'
        case '-1-1-3':
          return '猜三四名'
        case '-1-1-4':
          return '猜三四名'
        case '-1-1-5':
          return '猜三四名'
        case '-1-1-8':
          return '猜冠亚军'
        case '-1-3-1':
        case '-1-3-2':
        case '-1-3-3':
        case '-1-3-4':
        case '-1-3-5':
          return '龙虎'
        case '-1-1-7':
          return '定位胆'
        case '-1-1-9':
          return '猜三四名'
        case '-1-2-1':
          return '猜三四名'
        case '-1-2-2':
          return '猜三四名'
        case '-1-2-3':
          return '猜三四名'
        case '-1-2-4':
          return '猜三四名'
      }

      switch (this.type.id) {
        case '-1-4-1-PK10':
        case '-1-4-2-PK10':
        case '-1-4-3-PK10':
        case '-1-4-4-PK10':
          return '前二'
        case '-1-4-5-PK10':
        case '-1-4-6-PK10':
        case '-1-4-7-PK10':
        case '-1-4-8-PK10':
          return '后二'
        case '-1-4-9-PK10':
        case '-1-4-10-PK10':
        case '-1-4-11-PK10':
        case '-1-4-12-PK10':
          return '三四名'
        case '-1-5-1-PK10':
        case '-1-5-2-PK10':
        case '-1-5-3-PK10':
        case '-1-5-4-PK10':
          return '前三'
        case '-1-5-5-PK10':
        case '-1-5-6-PK10':
        case '-1-5-7-PK10':
        case '-1-5-8-PK10':
          return '后三'
        case '-1-6-1-PK10':
        case '-1-6-2-PK10':
        case '-1-6-3-PK10':
        case '-1-6-4-PK10':
          return '前四'
        case '-1-6-5-PK10':
        case '-1-6-6-PK10':
        case '-1-6-7-PK10':
        case '-1-6-8-PK10':
          return '后四'
        case '-1-7-1-PK10':
        case '-1-7-2-PK10':
        case '-1-7-3-PK10':
        case '-1-7-4-PK10':
          return '前五'
        case '-1-7-5-PK10':
        case '-1-7-6-PK10':
        case '-1-7-7-PK10':
        case '-1-7-8-PK10':
          return '后五'

        case '-1-8-1-PK10':
        case '-1-8-2-PK10':
        case '-1-8-3-PK10':
        case '-1-8-4-PK10':
        case '-1-8-5-PK10':
        case '-1-8-6-PK10':
          return '不定位'
        case '-1-9-1-PK10':
          return '冠亚和值'
        case '-1-9-2-PK10':
          return '冠亚和值'
        case '-1-10-1-PK10':
          return '大小单双'
      }
    }
  }
}
</script>
