<script>
import common from './common'
export default {
  mixins: [common],
  data () {
    return {
      gameType: 'PK10',
      menus: [
        {
          title: '猜冠亚军',
          groups: [
            {
              items: [
                {id: '-1-1-1-PK10', title: '猜冠军', description: '从01-10中共10个号码中选择1个号码，每注由1个号码组成，只要当期冠军号码为所选号码，即为中奖。', example: '投注方案：01； 开奖号码：01 * * * * * * * * * *，即中猜冠军。'},
                {id: '-1-1-2-PK10', title: '猜冠亚军', description: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02； 开奖号码：01 02 * * * * * * * * *，即中猜冠亚军。'},
                {id: '-1-1-8-PK10', title: '猜冠亚军单式', description: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖。', example: '投注方案：0102； 开奖号码：01 02 * * * * * * * * *，即中猜冠亚军单式。'}
              ]
            }
          ]
        },
        {
          title: '猜三四名',
          groups: [
            {
              items: [
                {id: '-1-1-3-PK10', title: '猜前三名', description: '从01-10共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02,03； 开奖号码：01 02 03 * * * * * * * *，即中猜前三名。'},
                {id: '-1-2-2-PK10', title: '猜前三名单式', description: '从01-10共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02,03； 开奖号码：01 02 03 * * * * * * * *，即中猜前三名单式。'},
                {id: '-1-1-4-PK10', title: '猜前四名', description: '从01-10共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02,03,04； 开奖号码：01 02 03 04 * * * * * * *，即中猜前四名。'},
                {id: '-1-2-3-PK10', title: '猜前四名单式', description: '从01-10共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02,03,04； 开奖号码：01 02 03 04 * * * * * * *，即中猜前四名单式。'},
                {id: '-1-2-1-PK10', title: '猜三四名复式', description: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的第3个,第4个号码相同，且顺序一致，即为中奖。', example: '投注方案：0102； 开奖号码：* * 01 02 * * * * * * *，即中猜冠亚军单式。'},
                {id: '-1-1-9-PK10', title: '猜三四名单式', description: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的第3个,第4个号码相同，且顺序一致，即为中奖。', example: '投注方案：0102； 开奖号码：* * 01 02 * * * * * * *，即中猜冠亚军单式。'}

              ]
            }
          ]
        },
        {
          title: '龙虎',
          groups: [
            {
              items: [
                {id: '-1-3-1-PK10', title: '一VS十', description: '第一名和第十名比较，第一名大是龙，第十名大是虎', example: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。', ps: '0,9', ludan: '1v10', ludantitle: '一VS十'},
                {id: '-1-3-2-PK10', title: '二VS九', description: '第二名和第九名比较，第二名大是龙，第九名大是虎', example: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。', ps: '1,8', ludan: '2v9', ludantitle: '二VS九'},
                {id: '-1-3-3-PK10', title: '三VS八', description: '第三名和第八名比较，第三名大是龙，第八名大是虎', example: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。', ps: '2,7', ludan: '3v8', ludantitle: '三VS八'},
                {id: '-1-3-4-PK10', title: '四VS七', description: '第四名和第七名比较，第四名大是龙，第七名大是虎', example: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。', ps: '3,6', ludan: '4v7', ludantitle: '四VS七'},
                {id: '-1-3-5-PK10', title: '五VS六', description: '第五名和第六名比较，第五名大是龙，第六名大是虎', example: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。', ps: '4,5', ludan: '5v6', ludantitle: '五VS六'}
              ]
            }
          ]
        },
        {
          title: '定位胆',
          groups: [
            {
              items: [
                {id: '-1-1-7-PK10', title: '定位胆', description: '从第一名到第十名、01-10共10个号码中，选择其中一名次中的任意1个号码当作一注，所选名次的号码与当期顺序摇出的10个号码中对应名次的号码一致，即为中奖', example: '投注方案：第一名01，开奖号码： 01 * * * * * * * * *，即中定位胆'}
              ]
            }
          ]
        }
      ],
      // 玩法信息
      type: {
        id: '-1-1-1-PK10',
        // 玩法名
        title: '猜冠军',
        // 玩法描述
        description: '从01-10中共10个号码中选择1个号码，每注由1个号码组成，只要当期冠军号码为所选号码，即为中奖。'
      },
      lucknumbers: ['01', '01', '01', '01', '01', '01', '01', '01', '01', '01'],
      getTitle () {
        switch (this.type.id.slice(0, 6)) {
          case '-1-1-1':
            return '猜冠亚军'
          case '-1-1-2':
            return '猜冠亚军'
          case '-1-1-3':
            return '猜三四名'
          case '-1-1-4':
            return '猜三四名'
          case '-1-1-5':
            return '猜三四名'
          case '-1-1-8':
            return '猜冠亚军'
          case '-1-3-1':
          case '-1-3-2':
          case '-1-3-3':
          case '-1-3-4':
          case '-1-3-5':
            return '龙虎'
          case '-1-1-7':
            return '定位胆'
          case '-1-1-9':
            return '猜三四名'
          case '-1-2-1':
            return '猜三四名'
          case '-1-2-2':
            return '猜三四名'
          case '-1-2-3':
            return '猜三四名'
          case '-1-2-4':
            return '猜三四名'
        }
      }
    }
  },
  methods: {
    getUpTitle () {
      switch (this.type.id.slice(0, 6)) {
        case '-1-1-1':
          return '猜冠亚军'
        case '-1-1-2':
          return '猜冠亚军'
        case '-1-1-3':
          return '猜三四名'
        case '-1-1-4':
          return '猜三四名'
        case '-1-1-5':
          return '猜三四名'
        case '-1-1-8':
          return '猜冠亚军'
        case '-1-3-1':
        case '-1-3-2':
        case '-1-3-3':
        case '-1-3-4':
        case '-1-3-5':
          return '龙虎'
        case '-1-1-7':
          return '定位胆'
        case '-1-1-9':
          return '猜三四名'
        case '-1-2-1':
          return '猜三四名'
        case '-1-2-2':
          return '猜三四名'
        case '-1-2-3':
          return '猜三四名'
        case '-1-2-4':
          return '猜三四名'
      }
    }
  }
}
</script>
