<script>
import common from './common'
export default {
  mixins: [common],
  data () {
    return {
      gameType: 'SSL',
      menus: [
        {
          title: '三星',
          groups: [
            {
              title: '直选',
              items: [
                {id: '-3-1-1', title: '直选复式', description: '从百位、十位、个位中选择一个3位数号码组成一注，所选号码与开奖号码的后3位相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码后三位：345，即中三星直选。'},
                {id: '-3-1-2', title: '直选单式', description: '手动输入一个3位数号码组成一注，所选号码的百位、十位、个位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码后三位：345，即中三星直选。'},
                {id: '-3-1-3', title: '直选和值', description: '所选数值等于开奖号码的百位、十位、个位三个数字相加之和，即为中奖。', example: '投注方案：和值1；开奖号码后三位：001,010,100,即中三星直选。'}
              ]
            },
            {
              title: '组选',
              items: [
                {id: '-3-2-1', title: '组三复式', description: '从0-9中选择2个数字组成两注，所选号码与开奖号码的百位、十位、个位相同，且顺序不限，即为中奖。', example: '投注方案：5,8,8；开奖号码后三位：1个5，2个8 (顺序不限)，即中后三组三。'},
                {id: '-3-2-2', title: '组三单式', description: '手动输入一个3位数号码组成一注，开奖号码的百位、十位、个位相同，顺序不限，且符合组三为中奖。', example: '投注方案：5,8,8；开奖号码后三位：1个5，2个8 (顺序不限)，即中后三组三。'},
                {id: '-3-2-3', title: '组六复式', description: '从0-9中任意选择3个号码组成一注，所选号码与开奖号码的百位、十位、个位相同，顺序不限，即为中奖。', example: '投注方案：2,5,8；开奖号码后三位：1个2、1个5、1个8 (顺序不限)，即中后三组六。'},
                {id: '-3-2-4', title: '组六单式', description: '手动输入一个3位数号码组成一注，开奖号码的百位、十位、个位相同，顺序不限，且符合组六为中奖。', example: '投注方案：2,5,8；开奖号码后三位：1个2、1个5、1个8 (顺序不限)，即中后三组六。'},
                {id: '-3-2-5', title: '混合组选', description: '手动输入一个3位数号码组成一注(不含豹子号)，开奖号码的百位、十位、个位符合后三组三或组六均为中奖。', example: '投注方案：分別投注(0,0,1),以及(1,2,3)，开奖号码后三位包括：(1)0,0,1，顺序不限，即中得组三；或者(2)1,2,3，顺序不限，即中得组六。'},
                {id: '-3-3-1', title: '和值', description: '所选数值等于开奖号码百位、十位、个位三个数字相加之和(不含豹子号)，即为中奖。', example: '投注方案：和值3；开奖号码后三位：(1)开出003号码，顺序不限，即中后三组三；(2)开出012号码，顺序不限，即中后三组六。'}
              ]
            }
          ]
        },
        // {
        //   title: '三星',
        //   groups: [
        //     {
        //       title: '直选',
        //       items: [
        //         {id: '+3-1-1', title: '直选复式', description: '从万位、千位、百位中选择一个3位数号码组成一注，所选号码与开奖号码的前3位相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码前三位：345，即中前三直选。'},
        //         {id: '+3-1-2', title: '直选单式', description: '手动输入一个3位数号码组成一注，所选号码的万位、千位、百位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码前三位：345，即中前三直选。'},
        //         {id: '+3-1-3', title: '直选和值', description: '所选数值等于开奖号码的万位、千位、百位三个数字相加之和，即为中奖。', example: '投注方案：和值1；开奖号码前三位：001,010,100,即中前三直选。'}
        //       ]
        //     },
        //     {
        //       title: '组选',
        //       items: [
        //         {id: '+3-2-1', title: '组三复式', description: '从0-9中选择2个数字组成两注，所选号码与开奖号码的万位、千位、百位相同，且顺序不限，即为中奖。 ', example: '投注方案：5,8,8；开奖号码前三位：1个5，2个8 (顺序不限)，即中前三组三'},
        //         {id: '+3-2-2', title: '组三单式', description: '手动输入一个3位数号码组成一注，开奖号码的万位、千位、百位相同，顺序不限，且符合组三为中奖。', example: '投注方案：5,8,8；开奖号码前三位：1个5，2个8 (顺序不限)，即中前三组三'},
        //         {id: '+3-2-3', title: '组六复式', description: '从0-9中任意选择3个号码组成一注，所选号码与开奖号码的万位、千位、百位相同，顺序不限，即为中奖。', example: '投注方案：2,5,8；开奖号码前三位：1个2、1个5、1个8 (顺序不限)，即中前三组六。'},
        //         {id: '+3-2-4', title: '组六单式', description: '手动输入一个3位数号码组成一注，开奖号码的万位、千位、百位相同，顺序不限，且符合组六为中奖。', example: '投注方案：2,5,8；开奖号码前三位：1个2、1个5、1个8 (顺序不限)，即中前三组六。'},
        //         {id: '+3-2-5', title: '混合组选', description: '手动输入一个3位数号码组成一注(不含豹子号)，开奖号码的万位、千位、百位符合后三组三或组六均为中奖', example: '投注方案：分別投注(0,0,1),以及(1,2,3)，开奖号码前三位包括：(1)0,0,1，顺序不限，即中得组三；或者(2)1,2,3，顺序不限，即中得组六。'},
        //         {id: '+3-3-1', title: '和值(不含豹子号)', description: '所选数值等于开奖号码万位、千位、百位三个数字相加之和(不含豹子号)，即为中奖。', example: '投注方案：和值3；开奖号码前三位：(1)开出003号码，顺序不限，即中前三组三；(2)开出012号码，顺序不限，即中前三组六。'}
        //       ]
        //     }
        //   ]
        // },
        {
          title: '二星',
          groups: [
            {
              title: '前二直选',
              items: [
                {id: '2-1-1-SSL', title: '直选复式', description: '从百位、十位中选择一个2位数号码组成一注，所选号码与开奖号码的百位、十位相同，且顺序一致，即为中奖。 ', example: '投注方案：58；开奖号码百位、十位：58，即中前二直选。'},
                {id: '2-1-2-SSL', title: '直选单式', description: '手动输入一个2位数号码组成一注，所选号码的百位、十位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：58；开奖号码百位、十位：58，即中前二直选。'}
              ]
            },
            {
              title: '前二组选',
              items: [
                {id: '2-2-1-SSL', title: '组选复式', description: '从0-9中选2个号码组成一注，所选号码与开奖号码的百位、十位相同，顺序不限（不含对子号），即中奖。 ', example: '投注方案：5,8；开奖号码百位、十位：85 或58(顺序不限，不含对子号)，即中前二组选。'},
                {id: '2-2-2-SSL', title: '组选单式', description: '手动输入一个2位数号码组成一注，所选号码的百位、十位与开奖号码相同，顺序不限（不含对子号），即为中奖。', example: '投注方案：5,8；开奖号码百位、十位：85 或58(顺序不限，不含对子号)，即中前二组选。'}
              ]
            },
            {
              title: '后二直选',
              items: [
                {id: '2-3-1', title: '直选复式', description: '从十位、个位中选择一个2位数号码组成一注，所选号码与开奖号码的后2位相同，且顺序一致，即为中奖。 ', example: '投注方案：58；开奖号码百位、十位：58，即中后二直选。'},
                {id: '2-3-2', title: '直选单式', description: '手动输入一个2位数号码组成一注，所选号码的十位、个位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：58；开奖号码百位、十位：58，即中后二直选。'}
              ]
            },
            {
              title: '后二组选',
              items: [
                {id: '2-4-1', title: '组选复式', description: '从0-9中选2个号码组成一注，所选号码与开奖号码的十位、个位相同，顺序不限（不含对子号），即中奖。 ', example: '投注方案：5,8；开奖号码百位、十位：85 或58(顺序不限，不含对子号)，即中后二组选。'},
                {id: '2-4-2', title: '组选单式', description: '手动输入一个2位数号码组成一注，所选号码的十位、个位与开奖号码相同，顺序不限（不含对子号），即为中奖。', example: '投注方案：5,8；开奖号码百位、十位：85 或58(顺序不限，不含对子号)，即中后二组选。'}
              ]
            }
          ]
        },
        {
          title: '一星',
          groups: [
            {
              title: '',
              items: [
                {id: '1-1-1-SSL', title: '定位胆', description: '从百位、十位、个位任意位置上至少选择1个以上号码，所选号码与相同位置上的开奖号码一致，即为中奖。', example: '投注方案：百位 1；开奖号码百位：1，即中定位胆百位。'}
              ]
            }
          ]
        },
        {
          title: '不定位',
          groups: [
            {
              title: '',
              items: [
                {id: '0-1-1', title: '一码不定位', description: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的百位、十位、个位中包含所选号码，即为中奖', example: '投注方案：1；开奖号码前三位：至少出现1个1，即中前三一码不定位。'},
                {id: '0-1-2', title: '二码不定位', description: '从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的百位、十位、个位中同时包含所选的2个号码，即为中奖', example: '投注方案：1,2；开奖号码前三位：至少出现1和2各1个，即中前三二码不定位。'}
              ]
            }
          ]
        },
        {
          title: '趣味',
          groups: [
            {
              title: '大小单双',
              items: [
                {id: '-2-1-1-SSL', title: '前二大小单双', description: '对百位、十位的“大（56789）小（01234）、单（13579）双（02468）”形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。', example: '投注方案：小双；开奖号码百位与十位：小双，即中前二大小单双。'},
                {id: '-2-1-2', title: '后二大小单双', description: '对十位和个位的“大（56789）小（01234）、单（13579）双（02468）”形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。', example: '投注方案：大单；开奖号码十位与个位：大单，即中后二大小单双。'}
              ]
            }
          ]
        }
      ],
      getTitle () {
        switch (this.type.id.slice(0, 2)) {
          case '5-':
            return '五星'
          case '4-':
            return '四星'
          case '3-':
            return '中三'
          case '+3':
            return '后三'
          case '-3':
            return '三星'
          case '2-':
            return '二星'
          case '1-':
            return '一星'
          case '0-':
            return '不定位'
          case '-1':
            return '任选'
          case '-2':
            return '趣味'
        }
      },
      // 玩法信息
      type: {
        id: '-3-1-1',
        // 玩法名
        title: '直选复式',
        // 玩法描述
        description: '从百位、十位、个位中选择一个3位数号码组成一注，所选号码与开奖号码的后3位相同，且顺序一致，即为中奖。'
      }
    }
  },
  methods: {
    getUpTitle () {
      switch (this.type.id.slice(0, 2)) {
        case '5-':
          return '五星'
        case '4-':
          return '四星'
        case '3-':
          return '中三'
        case '+3':
          return '后三'
        case '-3':
          return '三星'
        case '2-':
          return '二星'
        case '1-':
          return '一星'
        case '0-':
          return '不定位'
        case '-1':
          return '任选'
        case '-2':
          return '趣味'
      }
    }
  }
}
</script>
